# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений
# чисел от 1 до N.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]


n = int(input('N: '))
ls = []

for i in range(n):
    mult = 1
    for k in range(i + 1):
        mult *= k + 1
    ls.append(mult)

print(ls)
