# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

i1 = 4
fl1 = 5.3
s1 = "Это строка"
b1 = False

print(f'{i1=}, {type(i1)=}, {id(i1)=}, {hash(i1)=}')
print(f'{fl1=}, {type(fl1)=}, {id(fl1)=}, {hash(fl1)=}')
print(f'{s1=}, {type(s1)=}, {id(s1)=}, {hash(s1)=}')
print(f'{b1=}, {type(b1)=}, {id(b1)=}, {hash(b1)=}')