import random as rm
import sys as s
import math as mt

# Вспомните какие модули вы уже проходили на курсе.
# Создайте файл, в котором вы импортируете встроенные в модуль функции под псевдонимами.
# (3-7 строк импорта).

my_number = rm.randint(1, 10)
print(my_number)

a_cos = mt.acos(0.5)
print(a_cos)

s.exit()
