# 1. Напишите программу, которая принимает на вход число N и выдаёт
# последовательность из N членов.

N = int(input('Введите число: '))

for i in range(5):
    print((-3)**i)