# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

str1 = input()
str2 = input()

print(str1.count(str2))

print(str1.count(str2), 3, 7) # поиск с 3 по 7 символ

# dir(str) - выввести названия функций для работы со строками


# Гитигнор для Питона
# https://github.com/NarimanovRovshan/python/blob/main/.gitignore
